; domain
(define (domain minerob)
  (:requirements :strips :typing :negative-preconditions :equality :adl)

  (:types area minecar)

  (:predicates
    (robot-at ?a - area)                    ;; robot is located at area ?a
    (minecar-at ?m - minecar ?a - area)     ;; minecar ?m is at area ?a
    (minerals ?a - area)                    ;; area ?a contains minerals
    (depleted ?a - area)                    ;; area ?a has been depleted (no minerals)
    (empty ?a - area)                       ;; there is no minecar in area ?a
    (adjacent ?a1 - area ?a2 - area)        ;; adjacency (horizontal/vertical)
  )

  ;; MOVE: robot walks from one area to an adjacent area.
  ;; Precondition: destination must be empty of minecars.
  (:action move
    :parameters (?from - area ?to - area)
    :precondition (and
      (robot-at ?from)
      (adjacent ?from ?to)
      ;(empty ?to)                            ;; cannot step into a minecar
    )
    :effect (and
      (not (robot-at ?from))
      (robot-at ?to)
    )
  )

  ;; COLLECT: robot drills and collects minerals in current area.
  (:action collect
    :parameters (?a - area)
    :precondition (and
      (robot-at ?a)
      (minerals ?a)
      (empty ?a)                               ;; not minecart into to collect
    )
    :effect (and
      (not (minerals ?a))
      (depleted ?a)
    )
  )

  ;; PUSH: robot pushes a minecar forward.
  ;; Semantics chosen: robot stands *behind* the minecar, pushes the minecar from its current cell into the next cell.
  ;; Precond: robot adjacent to minecar source cell, the target cell (where the minecar will go) is adjacent to the minecar cell and is empty.
  ;; Effects: robot moves into the minecar's old cell, minecar moves into the target cell;
  ;;          minecar's old cell becomes empty, the target cell becomes non-empty.
  (:action push
    :parameters (?m - minecar ?mcpos - area ?target - area)
    :precondition (and
      (robot-at ?mcpos)
      (minecar-at ?m ?mcpos)
      (adjacent ?mcpos ?target)              ;; target is adjacent to minecar cell
      (empty ?target)                         ;; target must be free of minecars
    )
    :effect (and
      ;; robot moves into minecar's old position
      ;(not (robot-at ?rpos))
      ;(robot-at ?mcpos)

      ;; minecar moves from mcpos to target
      (not (minecar-at ?m ?mcpos))
      (minecar-at ?m ?target)

      ;; empty predicate bookkeeping
      (empty ?mcpos)                          ;; old minecar cell becomes empty
      (not (empty ?target))                   ;; new minecar cell becomes non-empty
    )
  )
)

; problem
(define (problem minerob-5x5-extreme)
  (:domain minerob)

  (:objects
    a1 a2 a3 a4 a5 a6 a7 a8 a9 a10 
    a11 a12 a13 a14 a15 a16 a17 a18 a19 a20
    a21 a22 a23 a24 a25 - area
    carA carB carC carD carE - minecar
  )

  (:init
    ;; --- Adjacency (Completa 5x5) ---
    (adjacent a1 a2) (adjacent a2 a1) (adjacent a2 a3) (adjacent a3 a2) (adjacent a3 a4) (adjacent a4 a3) (adjacent a4 a5) (adjacent a5 a4)
    (adjacent a6 a7) (adjacent a7 a6) (adjacent a7 a8) (adjacent a8 a7) (adjacent a8 a9) (adjacent a9 a8) (adjacent a9 a10) (adjacent a10 a9)
    (adjacent a11 a12) (adjacent a12 a11) (adjacent a12 a13) (adjacent a13 a12) (adjacent a13 a14) (adjacent a14 a13) (adjacent a14 a15) (adjacent a15 a14)
    (adjacent a16 a17) (adjacent a17 a16) (adjacent a17 a18) (adjacent a18 a17) (adjacent a18 a19) (adjacent a19 a18) (adjacent a19 a20) (adjacent a20 a19)
    (adjacent a21 a22) (adjacent a22 a21) (adjacent a22 a23) (adjacent a23 a22) (adjacent a23 a24) (adjacent a24 a23) (adjacent a24 a25) (adjacent a25 a24)

    (adjacent a1 a6) (adjacent a6 a1) (adjacent a6 a11) (adjacent a11 a6) (adjacent a11 a16) (adjacent a16 a11) (adjacent a16 a21) (adjacent a21 a16)
    (adjacent a2 a7) (adjacent a7 a2) (adjacent a7 a12) (adjacent a12 a7) (adjacent a12 a17) (adjacent a17 a12) (adjacent a17 a22) (adjacent a22 a17)
    (adjacent a3 a8) (adjacent a8 a3) (adjacent a8 a13) (adjacent a13 a8) (adjacent a13 a18) (adjacent a18 a13) (adjacent a18 a23) (adjacent a23 a18)
    (adjacent a4 a9) (adjacent a9 a4) (adjacent a9 a14) (adjacent a14 a9) (adjacent a14 a19) (adjacent a19 a14) (adjacent a19 a24) (adjacent a24 a19)
    (adjacent a5 a10) (adjacent a10 a5) (adjacent a10 a15) (adjacent a15 a10) (adjacent a15 a20) (adjacent a20 a15) (adjacent a20 a25) (adjacent a25 a20)

    ;; --- Robot Start ---
    (robot-at a1)

    ;; --- Minecars Initial Positions ---
    (minecar-at carA a7)  
    (minecar-at carB a12) 
    (minecar-at carC a17) 
    (minecar-at carD a10) ; Carro en celda con minerales
    (minecar-at carE a16) 

    ;; --- Minerals Initial Positions ---
    (minerals a2)
    (minerals a5)
    (minerals a10) ; Con CarD
    (minerals a19)
    (minerals a24)
    (minerals a25)

    ;; --- Empty Bookkeeping ---
    ;; Todas las celdas sin minecar deben ser 'empty'
    (empty a1) (empty a2) (empty a3) (empty a4) (empty a5) (empty a6) 
    (empty a8) (empty a9) (empty a11) (empty a13) (empty a14) (empty a15) 
    (empty a18) (empty a19) (empty a20) (empty a21) (empty a22) (empty a23) (empty a24) (empty a25)

    ;; --- Depleted (Resto de celdas) ---
    (depleted a3) (depleted a4) (depleted a6) (depleted a8) (depleted a9) (depleted a11)
    (depleted a13) (depleted a14) (depleted a15) (depleted a18) (depleted a20) (depleted a21) (depleted a22) (depleted a23)
  )

  (:goal (and
    ;; --- Minerales Depleted ---
    (depleted a2)
    (depleted a5)
    (depleted a10)
    (depleted a19)
    (depleted a24)
    (depleted a25)
    
    ;; --- Final positions for minecars ---
    (minecar-at carA a2)
    (minecar-at carB a17)
    (minecar-at carC a12)
    (minecar-at carD a5)
    (minecar-at carE a20)

    ;; --- Final position for robot ---
    (robot-at a25)
  ))
)

; plan
1. (move a1 a2)
   deleted: (robot-at a1)
   added: (robot-at a2)
   goals met: 0 of 12
2. (collect a2)
   deleted: (minerals a2)
   added: (depleted a2)
   goals met: 1 of 12
3. (move a2 a3)
   deleted: (robot-at a2)
   added: (robot-at a3)
   goals met: 1 of 12
4. (move a3 a4)
   deleted: (robot-at a3)
   added: (robot-at a4)
   goals met: 1 of 12
5. (move a4 a5)
   deleted: (robot-at a4)
   added: (robot-at a5)
   goals met: 1 of 12
6. (collect a5)
   deleted: (minerals a5)
   added: (depleted a5)
   goals met: 2 of 12
7. (move a5 a10)
   deleted: (robot-at a5)
   added: (robot-at a10)
   goals met: 2 of 12
8. (push card a10 a5)
   deleted: (minecar-at card a10) (empty a5)
   added: (minecar-at card a5) (empty a10)
   goals met: 3 of 12
9. (collect a10)
   deleted: (minerals a10)
   added: (depleted a10)
   goals met: 4 of 12
10. (move a10 a9)
   deleted: (robot-at a10)
   added: (robot-at a9)
   goals met: 4 of 12
11. (move a9 a8)
   deleted: (robot-at a9)
   added: (robot-at a8)
   goals met: 4 of 12
12. (move a8 a7)
   deleted: (robot-at a8)
   added: (robot-at a7)
   goals met: 4 of 12
13. (push cara a7 a2)
   deleted: (minecar-at cara a7) (empty a2)
   added: (minecar-at cara a2) (empty a7)
   goals met: 5 of 12
14. (move a7 a12)
   deleted: (robot-at a7)
   added: (robot-at a12)
   goals met: 5 of 12
15. (push carb a12 a13)
   deleted: (minecar-at carb a12) (empty a13)
   added: (minecar-at carb a13) (empty a12)
   goals met: 5 of 12
16. (move a12 a17)
   deleted: (robot-at a12)
   added: (robot-at a17)
   goals met: 5 of 12
17. (push carc a17 a12)
   deleted: (minecar-at carc a17) (empty a12)
   added: (minecar-at carc a12) (empty a17)
   goals met: 6 of 12
18. (move a17 a16)
   deleted: (robot-at a17)
   added: (robot-at a16)
   goals met: 6 of 12
19. (push care a16 a17)
   deleted: (minecar-at care a16) (empty a17)
   added: (minecar-at care a17) (empty a16)
   goals met: 6 of 12
20. (move a16 a17)
   deleted: (robot-at a16)
   added: (robot-at a17)
   goals met: 6 of 12
21. (push care a17 a18)
   deleted: (minecar-at care a17) (empty a18)
   added: (minecar-at care a18) (empty a17)
   goals met: 6 of 12
22. (move a17 a18)
   deleted: (robot-at a17)
   added: (robot-at a18)
   goals met: 6 of 12
23. (push care a18 a19)
   deleted: (minecar-at care a18) (empty a19)
   added: (minecar-at care a19) (empty a18)
   goals met: 6 of 12
24. (move a18 a13)
   deleted: (robot-at a18)
   added: (robot-at a13)
   goals met: 6 of 12
25. (push carb a13 a18)
   deleted: (minecar-at carb a13) (empty a18)
   added: (minecar-at carb a18) (empty a13)
   goals met: 6 of 12
26. (move a13 a18)
   deleted: (robot-at a13)
   added: (robot-at a18)
   goals met: 6 of 12
27. (push carb a18 a17)
   deleted: (minecar-at carb a18) (empty a17)
   added: (minecar-at carb a17) (empty a18)
   goals met: 7 of 12
28. (move a18 a19)
   deleted: (robot-at a18)
   added: (robot-at a19)
   goals met: 7 of 12
29. (push care a19 a20)
   deleted: (minecar-at care a19) (empty a20)
   added: (minecar-at care a20) (empty a19)
   goals met: 8 of 12
30. (collect a19)
   deleted: (minerals a19)
   added: (depleted a19)
   goals met: 9 of 12
31. (move a19 a24)
   deleted: (robot-at a19)
   added: (robot-at a24)
   goals met: 9 of 12
32. (collect a24)
   deleted: (minerals a24)
   added: (depleted a24)
   goals met: 10 of 12
33. (move a24 a25)
   deleted: (robot-at a24)
   added: (robot-at a25)
   goals met: 11 of 12
34. (collect a25)
   deleted: (minerals a25)
   added: (depleted a25)
   goals met: 12 of 12
